A opressão por parte das corporações é um problema mais grave do que a opressão por parte dos governos.
É necessário que o governo intervenha na economia para proteger os consumidores.
Quanto mais livre é o mercado, mais livres são as pessoas.
É melhor manter o orçamento em ordem do que garantir o bem-estar social para todos os cidadãos.
Pesquisas publicamente financiadas são um maior benefício a população do que deixá-las exclusivamente sob a administração do setor privado.
Taxação em produtos internacionais são importantes, pois encorajam a produção local.
De cada qual, segundo sua capacidade; a cada qual, segundo suas necessidades.
Seria melhor se programas sociais fossem abolidos em favor da caridade privada.
Os impostos deveriam ser aumentados para os ricos, em benefício dos pobres.
A herança é uma forma legítima de riqueza.
Areas e serviços de utilidade pública, como estradas e eletricidade, deveriam ser propriedade do Estado.
Uma intervenção excessiva do Estado no Mercado é um risco à economia.
Aqueles que podem pagar devem receber o melhor acesso à saúde.
A educação de qualidade é um direito de todos.
Os meios de produção deveriam pertencer aos trabalhadores que os utilizam.
A ONU (Organização das Nações Unidas) deveria ser abolida.
A ação militar preventiva por parte de nossa nação é por vezes necessária para protegê-la.
Eu apoio ligas regionais de países, como a União Europeia.
É muito importante manter a nossa soberania nacional.
Um mundo unido com agendas mútuas seria algo benéfico para a humanidade.
É mais importante manter relações pacíficas com os demais países do que aumentar a nossa força militar.
Nossas guerras não precisam ser justificadas aos demais países.
Despesas militares são um desperdício de dinheiro.
O apoio financeiro aos países necessitados é um desperdício de dinheiro.
Considero minha nação grandiosa.
Pesquisas científicas deveriam ser conduzidas em escala e cooperação global.
Governos deveriam ser responsáveis pela comunidade internacional.
Mesmo ao protestar contra um governo autoritário, a violência não é aceitável.
Meus valores religiosos precisam ser disseminados tanto quanto for possível.
Os valores tradicionais da nossa nação precisam ser disseminados tanto for quanto possível.
É muito importante a manutenção da lei e da ordem.
A população em geral toma decisões ruins.
Eutanásia deveria ser legalizada.
O sacrifício de algumas liberdades civis é necessário para nos proteger de atos terroristas.
A vigilância governamental é necessária no mundo moderno.
A própria existência do Estado é uma ameaça à nossa liberdade.
Independentemente das suas opiniões políticas, é importante ficar ao lado do seu país em momentos de necessidade.
Nenhuma autoridade deve ser mantida livre de questionamentos.
Um Estado hierárquico é o melhor caminho para a manutenção da ordem.
É importante que o governo siga a opinião da maioria, ainda que ela possa estar errada.
Quanto mais forte o líder for, melhor para a nação.
A democracia é mais do que um mero processo de tomada de decisões.
Regulações ambientais são essenciais para o mundo.
Um mundo melhor surgirá do avanço da automação, da ciência e da tecnologia.
Crianças devem ser educadas com valores religiosos ou tradicionais.
As tradições não possuem valor por si mesmas.
A religião deveria ter influência no governo.
Igrejas deveriam ser taxadas da mesma forma que outras instituições.
A mudança climática é atualmente uma das maiores ameaças ao nosso estilo de vida.
É importante trabalharmos conjuntamente, de forma global, para combatermos as mudanças climáticas.
Nossa sociedade era melhor e mais segura há décadas atrás.
É importante preservar as tradições do nosso passado.
É importante pensarmos a longo prazo, para além da nossa geração.
Seguir nossa razão e os novos rumos dos avanços científicos é algo mais importante do que preservar nossa cultura.
O uso de drogas deveria ser legalizado ou descriminalizado.
O casamento civil entre pessoas do mesmo sexo deveria ser legal.
Nenhuma cultura é superior a outra.
O sexo fora do casamento é algo imoral.
Se aceitarmos imigrantes, é importante que eles se assimilem a nossa cultura.
O aborto deveria ser proibido em todos os casos, ou em sua grande maioria.
A posse de armas deve ser proibida para quem não tenha uma razão válida para isso.
Eu apoio um sistema único e universal de saúde.
A prostituição deveria ser ilegal.
A manutenção dos valores familiares é algo essencial para a nossa sociedade.
Perseguir o progresso a qualquer custo é algo perigoso.
As pesquisas e práticas de alteração genética são algo que beneficia a humanidade, mesmo quando a genética humana está envolvida.
Nós devemos manter nossas fronteiras abertas para os imigrantes em geral.
Os governos deveriam estar tão preocupados com a situação social dos cidadãos estrangeiros quanto com os que nasceram em seu país.
Todas as pessoas - independentemente de fatores como cultura ou sexualidade - devem ser tratadas igualmente.
É importante que coloquemos os interesses do nosso grupo ideológico acima de todos os demais.